RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb_shared/usbdev/cy_usb_dev_cdc.h
/***************************************************************************//**
* \file cy_usb_dev_cdc.h
* \version 2.10
*
* Provides CDC class-specific API declarations.
*
********************************************************************************
* \copyright
* (c) 2018-2021, Cypress Semiconductor Corporation (an Infineon company) or
* an affiliate of Cypress Semiconductor Corporation. All rights reserved.
* You may use this file only in accordance with the license, terms, conditions,
* disclaimers, and limitations in the end user license agreement accompanying
* the software package with which this file was provided.
*******************************************************************************/


/**
* \addtogroup group_usb_dev_cdc
* This section provides API description for the CDC class.
*
* \{
*    \defgroup group_usb_dev_cdc_macros          Macros
*    \defgroup group_usb_dev_cdc_functions       Functions
*    \defgroup group_usb_dev_cdc_data_structures Data Structures
*    \defgroup group_usb_dev_cdc_enums           Enumerated Types
* \}
*/


#if !defined(CY_USB_DEV_CDC_H)
#define CY_USB_DEV_CDC_H

#include "cy_usb_dev.h"

#if (defined(CY_IP_MXUSBFS) || defined(CY_IP_M0S8USBDSS))

#if defined(__cplusplus)
extern "C" {
#endif


/*******************************************************************************
*                          API Constants
*******************************************************************************/

/**
* \addtogroup group_usb_dev_cdc_macros
* \{
*/
/** Number of supported COM ports */
#define CY_USB_DEV_CDC_COMPORT_NUMBER   (2U)

/* CDC Class requests */
#define CY_USB_DEV_CDC_RQST_SET_LINE_CODING         (0x20U)   /**< SetLineCoding CDC class request */
#define CY_USB_DEV_CDC_RQST_GET_LINE_CODING         (0x21U)   /**< GetLineCoding CDC class request */
#define CY_USB_DEV_CDC_RQST_SET_CONTROL_LINE_STATE  (0x22U)   /**< SetControlLineState CDC class request */
/** \} group_usb_dev_cdc_macros */


/*******************************************************************************
*                          Internal Constants
*******************************************************************************/

/** \cond INTERNAL */
#define CY_USB_DEV_CDC_SERIAL_STATE_SIZE            (10U)
#define CY_USB_DEV_CDC_LINE_CODING_CHAR_FORMAT_POS  (4U)
#define CY_USB_DEV_CDC_LINE_CODING_SIZE             (7U)
#define CY_USB_DEV_CDC_LINE_CODING_PARITY_BITS_POS  (5U)
#define CY_USB_DEV_CDC_LINE_CODING_DATA_BITS_POS    (6U)

#define CY_USB_DEV_CDC_IS_COM_VALID(com)    ((com) <= CY_USB_DEV_CDC_COMPORT_NUMBER)
/** \endcond */


/*******************************************************************************
*                          Enumerated Types
*******************************************************************************/

/**
* \addtogroup group_usb_dev_cdc_enums
* \{
*/

/** CDC Stop bit */
typedef enum
{
    CY_USB_DEV_CDC_STOPBIT_1,    /**< 1 stop bit */
    CY_USB_DEV_CDC_STOPBITS_1_5, /**< 1.5 stop bits */
    CY_USB_DEV_CDC_STOPBITS_2,   /**< 2 stop bits */
} cy_en_usb_dev_cdc_stop_bit_t;

/** CDC Parity type */
typedef enum
{
    CY_USB_DEV_CDC_PARITY_NONE,   /**< None parity */
    CY_USB_DEV_CDC_PARITY_ODD,    /**< Odd parity */
    CY_USB_DEV_CDC_PARITY_EVEN,   /**< Even parity */
    CY_USB_DEV_CDC_PARITY_MARK,   /**< Mark */
    CY_USB_DEV_CDC_PARITY_SPACE,  /**< Space */
} cy_en_usb_dev_cdc_parity_type_t;

/** \} group_usb_dev_cdc_enums */


/*******************************************************************************
*                          Type Definitions
*******************************************************************************/

/**
* \addtogroup group_usb_dev_cdc_data_structures
* \{
*/
/** CDC class configuration structure  */
typedef struct
{
    /** The pointers to the buffers to store received data by COM port 0 and 1
    * appropriately. The buffer is mandatory to for \ref Cy_USB_Dev_CDC_GetData
    * and \ref Cy_USB_Dev_CDC_GetChar function operation. If these functions
    * will not be used by the application pass NULL as a pointer. \n
    * Allocate buffer using \ref CY_USB_DEV_ALLOC_ENDPOINT_BUFFER macro to make
    * it USBFS driver configuration independent (See \ref group_usb_dev_ep_buf_alloc
    * for more information).
    */
    uint8_t *buffer[CY_USB_DEV_CDC_COMPORT_NUMBER];

    /** Size of provided buffers to for the COM port 0 and 1 appropriately.
    * The buffer size must be equal to the maximum packet size of CDC Data
    * interface IN endpoint that belongs to the COM port.
    * Pass zero size if the pointer to the buffer is NULL.
    */
    uint32_t bufferSize[CY_USB_DEV_CDC_COMPORT_NUMBER];


} cy_stc_usb_dev_cdc_config_t;

/** \cond INTERNAL: CDC COM port properties structure */
typedef struct
{
    /** Defines whether port is valid for usage */
    volatile bool valid;

    /** Buffer for byte read organization */
    uint8_t *buffer;

    /** Size of buffer */
    uint32_t bufferSize;

    /** Number of occupied bytes in buffer */
    uint32_t writeBufIdx;

    /** Number of occupied bytes in buffer */
    uint32_t readBufIdx;

    /** Contains the interface number used to define port number in requests. */
    volatile uint8_t interfaceNum;

    /**
      * Contains the data IN endpoint size. It is initialized after a
      * SET_CONFIGURATION request based on a user descriptor. It is used
      * in CDC functions to send data to the Host.
      */
    volatile uint16_t dataInEpSize;

    /**
      * Contains the data OUT endpoint size. It is initialized after a
      * SET_CONFIGURATION request based on user descriptor. It is used in
      * CDC functions to receive data from the Host.
      */
    volatile uint16_t dataOutEpSize;

    /**
      * Contains the IN interrupt endpoint size used for sending serial
      * state notification to the Host. It is initialized after a
      * SET_CONFIGURATION request based on a user descriptor. It is used
      * in the CDC function SendSerialState().
      */
    volatile uint16_t commEpSize;

    /**
      * Contains the current line coding structure. The Host sets it using
      * a SET_LINE_CODING request and returns it to the user code using
      * the GetDTERate(), GetCharFormat(), GetParityType(), and
      * GetDataBits() functions.
      */
    volatile uint8_t  linesCoding[CY_USB_DEV_CDC_LINE_CODING_SIZE];
    /**
      * Used as a flag for the IsLineChanged() function, to inform it that
      * the host has been sent a request to change line coding or control
      * bitmap.
      */
    volatile uint8_t linesChanged;

    /**
      * Contains the current control-signal bitmap. The Host sets it using
      * a SET_CONTROL_LINE request and returns it to the user code using
      * the GetLineControl() function.
      */
    volatile uint8_t linesControlBitmap;

    /**
      * Contains the 16-bit serial state value that was sent using the
      * SendSerialState() function.
      */
    volatile uint16_t serialStateBitmap;

    /**
      * Contains the 16-bit serial state value that was sent using the
      * SendSerialState() function.
      */
    volatile uint8_t serialStateNotification[CY_USB_DEV_CDC_SERIAL_STATE_SIZE];

    /**
      * Contains the data IN endpoint number. It is initialized after a
      * SET_CONFIGURATION request based on a user descriptor. It is used
      * in CDC functions to send data to the host.
      */
    volatile uint8_t dataInEp;

    /**
      * Contains the data OUT endpoint number. It is initialized after a
      * SET_CONFIGURATION request based on user descriptor. It is used in
      * CDC functions to receive data from the Host.
      */
    volatile uint8_t dataOutEp;

    /**
      * Contains the IN interrupt endpoint number used for sending serial
      * state notification to the host. It is initialized after a
      * SET_CONFIGURATION request based on a user descriptor. It is used
      * in the CDC function SendSerialState().
      */
    volatile uint8_t commEp;

} cy_stc_usb_dev_cdc_comport_t;
/** \endcond */

/** CDC class context structure.
* All fields for the CDC context structure are internal. Firmware never reads or
* writes these values. Firmware allocates the structure and provides the
* address of the structure to the middleware in CDC function calls. Firmware
* must ensure that the defined instance of this structure remains in scope while
* the middleware is in use.
*/
typedef struct
{
    /** \cond INTERNAL*/

