RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb_shared/usbdev/cy_usb_dev_cdc.h
    /** COM port description array */
    cy_stc_usb_dev_cdc_comport_t port[CY_USB_DEV_CDC_COMPORT_NUMBER];

    /** CDC class functions pointers */
    cy_stc_usb_dev_class_t classObj;

    /** CDC class linked list item */
    cy_stc_usb_dev_class_ll_item_t classItem;

    /** Device context */
    cy_stc_usb_dev_context_t *devContext;

    /**
    * Called after setupRequest was received (before internal processing).
    * Returns status of the event processing.
    */
    cy_cb_usb_dev_request_received_t requestReceived;

    /**
    * Called after setupRequest was received (before internal processing).
    * Returns status of the event processing.
    */
    cy_cb_usb_dev_request_cmplt_t requestCompleted;

    /** \endcond */

} cy_stc_usb_dev_cdc_context_t;
/** \} group_usb_dev_cdc_data_structures */


/*******************************************************************************
*                          Function Prototypes
*******************************************************************************/

/**
* \addtogroup group_usb_dev_cdc_functions
* \{
*/
cy_en_usb_dev_status_t Cy_USB_Dev_CDC_Init(cy_stc_usb_dev_cdc_config_t  const *config,
                                           cy_stc_usb_dev_cdc_context_t       *context,
                                           cy_stc_usb_dev_context_t           *devContext);

cy_en_usb_dev_status_t Cy_USB_Dev_CDC_PutData(uint32_t port, uint8_t const *buffer, uint32_t size,
                                              cy_stc_usb_dev_cdc_context_t *context);

cy_en_usb_dev_status_t Cy_USB_Dev_CDC_PutString(uint32_t port, char_t const *string, int32_t timeout,
                                                cy_stc_usb_dev_cdc_context_t  *context);

__STATIC_INLINE cy_en_usb_dev_status_t Cy_USB_Dev_CDC_PutChar(uint32_t port, char_t ch,
                                                              cy_stc_usb_dev_cdc_context_t *context);

uint32_t Cy_USB_Dev_CDC_GetCount(uint32_t port, cy_stc_usb_dev_cdc_context_t *context);

bool Cy_USB_Dev_CDC_IsDataReady(uint32_t port, cy_stc_usb_dev_cdc_context_t *context);

bool Cy_USB_Dev_CDC_IsReady(uint32_t port, cy_stc_usb_dev_cdc_context_t *context);

uint32_t Cy_USB_Dev_CDC_GetData(uint32_t port, uint8_t *buffer, uint32_t  size,
                                cy_stc_usb_dev_cdc_context_t  *context);

uint32_t Cy_USB_Dev_CDC_GetAll(uint32_t port, uint8_t *buffer,  uint32_t maxSize,
                               cy_stc_usb_dev_cdc_context_t *context);

char_t Cy_USB_Dev_CDC_GetChar(uint32_t port, cy_stc_usb_dev_cdc_context_t *context);

__STATIC_INLINE uint32_t Cy_USB_Dev_CDC_IsLineChanged(uint32_t port, cy_stc_usb_dev_cdc_context_t *context);

__STATIC_INLINE uint32_t Cy_USB_Dev_CDC_GetLineControl(uint32_t port, cy_stc_usb_dev_cdc_context_t const *context);

uint32_t Cy_USB_Dev_CDC_GetDTERate(uint32_t port, cy_stc_usb_dev_cdc_context_t *context);

__STATIC_INLINE cy_en_usb_dev_cdc_stop_bit_t Cy_USB_Dev_CDC_GetCharFormat(uint32_t port,
                                                                          cy_stc_usb_dev_cdc_context_t const *context);

__STATIC_INLINE cy_en_usb_dev_cdc_parity_type_t Cy_USB_Dev_CDC_GetParity(uint32_t port, cy_stc_usb_dev_cdc_context_t const *context);

__STATIC_INLINE uint32_t Cy_USB_Dev_CDC_GetDataBits(uint32_t port, cy_stc_usb_dev_cdc_context_t const *context);

cy_en_usb_dev_status_t Cy_USB_Dev_CDC_SendSerialState(uint32_t port, uint32_t serialState,
                                                      cy_stc_usb_dev_cdc_context_t *context);

bool Cy_USB_Dev_CDC_IsNotificationReady(uint32_t port, cy_stc_usb_dev_cdc_context_t *context);

__STATIC_INLINE void Cy_USB_Dev_CDC_RegisterUserCallbacks(cy_cb_usb_dev_request_received_t requestReceivedHandle,
                                                          cy_cb_usb_dev_request_cmplt_t    requestCompletedHandle,
                                                          cy_stc_usb_dev_cdc_context_t     *context);

__STATIC_INLINE cy_stc_usb_dev_class_t * Cy_USB_Dev_CDC_GetClass(cy_stc_usb_dev_cdc_context_t *context);

__STATIC_INLINE uint32_t Cy_USB_Dev_CDC_GetSerialState(uint32_t port, cy_stc_usb_dev_cdc_context_t const *context);
/** \} group_usb_dev_cdc_functions */


/*******************************************************************************
*                         API Constants
*******************************************************************************/

/**
* \addtogroup group_usb_dev_cdc_macros
* \{
*/

/**
* Indicates that a DTR signal is present. This signal corresponds to V.24
* signal 108/2 and RS232 signal DTR.
*/
#define CY_USB_DEV_CDC_LINE_CONTROL_DTR       (0x1U)

/**
* Carrier control for half-duplex modems. This signal corresponds to V.24
* signal 105 and RS232 signal RTS.
*/
#define CY_USB_DEV_CDC_LINE_CONTROL_RTS       (0x2U)

#define CY_USB_DEV_CDC_LINE_NOT_CHANGED       (0U)    /**< No line coding/line control changes */
#define CY_USB_DEV_CDC_LINE_CODING_CHANGED    (1U)    /**< Line coding changed */
#define CY_USB_DEV_CDC_LINE_CONTROL_CHANGED   (2U)    /**< Line control changed */

/** \} group_usb_dev_cdc_macros */


/*******************************************************************************
*                           In-line Function Implementation
*******************************************************************************/

/**
* \addtogroup group_usb_dev_cdc_functions
* \{
*/

/*******************************************************************************
* Function Name: Cy_USB_Dev_CDC_RegisterUserCallbacks
****************************************************************************//**
*
* Registering user callback to handle CDC class requests that are not supported
* by provided CDC request handler.
*
* \param requestReceivedHandle
* The pointer to a callback function.
* This function is called when setup packet was received from USB Host but was
* not recognized, therefore might require the user class processing.
* To remove callback function pass NULL as function pointer.
*
* \param requestCompletedHandle
* The pointer to a callback function.
* This function is called when USB Device received data from the USB Host
* as part of current request processing. The requestReceivedHandle function
* must enable notification to trigger this event. This makes sense only when CDC
* request processing requires a data stage.
* To remove callback function pass NULL as function pointer.
*
* \param context
* The pointer to the context structure \ref cy_stc_usb_dev_context_t allocated
* by the user. The structure is used during the Audio Class operation for
* internal configuration and data retention. The user must not modify anything
* in this structure.
*
*******************************************************************************/
__STATIC_INLINE void Cy_USB_Dev_CDC_RegisterUserCallbacks(cy_cb_usb_dev_request_received_t requestReceivedHandle,
                                                          cy_cb_usb_dev_request_cmplt_t    requestCompletedHandle,
                                                          cy_stc_usb_dev_cdc_context_t     *context)
{
    context->requestReceived  = requestReceivedHandle;
    context->requestCompleted = requestCompletedHandle;
}


