RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb_shared/usbdev/cy_usb_dev_cdc.h
/*******************************************************************************
* Function Name: Cy_USB_Dev_CDC_GetClass
****************************************************************************//**
*
* Returns pointer to the CDC class structure.
* This function is useful to override class event handlers using
* \ref group_usb_dev_functions_class_support.
*
* \param context
* The pointer to the context structure \ref cy_stc_usb_dev_cdc_context_t
* allocated by the user. The structure is used during the CDC Class operation
* for internal configuration and data retention. The user must not modify
* anything in this structure.
*
* \return
* The pointer to the CDC class structure.
*
*******************************************************************************/
__STATIC_INLINE cy_stc_usb_dev_class_t * Cy_USB_Dev_CDC_GetClass(cy_stc_usb_dev_cdc_context_t *context)
{
    return &context->classObj;
}


/*******************************************************************************
* Function Name: Cy_USB_Dev_CDC_GetSerialState
****************************************************************************//**
*
* Returns the current serial state value for the COM port.
*
* \param port
* COM port number. Valid ports are 0 and 1.
*
* \param context
* The pointer to the context structure \ref cy_stc_usb_dev_cdc_context_t
* allocated by the user. The structure is used during the CDC Class operation
* for internal configuration and data retention. The user must not modify
* anything in this structure.
*
* \return
* 16-bit serial state value. Refer to revision 1.2 of the CDC PSTN Subclass
* specification for bit field definitions of the 16-bit serial state value.
* Zero in case COM port is invalid.
*
*******************************************************************************/
__STATIC_INLINE uint32_t Cy_USB_Dev_CDC_GetSerialState(uint32_t port, cy_stc_usb_dev_cdc_context_t const *context)
{
    CY_ASSERT_L1(CY_USB_DEV_CDC_IS_COM_VALID(port));

    uint32_t retState = (context->port[port].valid) ?
                         context->port[port].serialStateBitmap : 0U;
    return retState;
}


/*******************************************************************************
* Function Name: Cy_USB_Dev_CDC_IsLineChanged
****************************************************************************//**
*
* Returns the clear-on-read status of the COM port.
*
* \param port
* COM port number. Valid ports are 0 and 1.
*
* \param context
* The pointer to the context structure \ref cy_stc_usb_dev_cdc_context_t
* allocated by the user. The structure is used during the CDC Class operation
* for internal configuration and data retention. The user must not modify
* anything in this structure.
*
* \return
* * \ref CY_USB_DEV_CDC_LINE_CODING_CHANGED when SET_LINE_CODING request is
*    received.
* * \ref CY_USB_DEV_CDC_LINE_CONTROL_CHANGED when CDC_SET_CONTROL_LINE_STATE
*    request is received.
* * \ref CY_USB_DEV_CDC_LINE_NOT_CHANGED when there were no request since last
*    call.
*
* \note
* This function is not interrupt-protected and to prevent a race condition,
* it should be protected from the USBFS interruption in the place where it
* is called.
*
*******************************************************************************/
__STATIC_INLINE uint32_t Cy_USB_Dev_CDC_IsLineChanged(uint32_t port, cy_stc_usb_dev_cdc_context_t *context)
{
    CY_ASSERT_L1(CY_USB_DEV_CDC_IS_COM_VALID(port));

    uint32_t retState = context->port[port].linesChanged;
    context->port[port].linesChanged = CY_USB_DEV_CDC_LINE_NOT_CHANGED;

    return retState;
}


/*******************************************************************************
* Function Name: Cy_USB_Dev_CDC_GetCharFormat
****************************************************************************//**
*
* Returns the number of stop bits for the COM port.
*
* \param port
* COM port number. Valid ports are 0 and 1.
*
* \param context
* The pointer to the context structure \ref cy_stc_usb_dev_cdc_context_t
* allocated by the user. The structure is used during the CDC Class operation
* for internal configuration and data retention. The user must not modify
* anything in this structure.
*
* \return
* Number of stop bits \ref cy_en_usb_dev_cdc_stop_bit_t.
*
*******************************************************************************/
__STATIC_INLINE cy_en_usb_dev_cdc_stop_bit_t Cy_USB_Dev_CDC_GetCharFormat(uint32_t port, cy_stc_usb_dev_cdc_context_t const *context)
{
    CY_ASSERT_L1(CY_USB_DEV_CDC_IS_COM_VALID(port));

    return (cy_en_usb_dev_cdc_stop_bit_t) context->port[port].linesCoding[CY_USB_DEV_CDC_LINE_CODING_CHAR_FORMAT_POS];
}


/*******************************************************************************
* Function Name: Cy_USB_Dev_CDC_PutChar
****************************************************************************//**
*
* Sends a single character to the USB Host.
* Call \ref Cy_USB_Dev_CDC_IsReady function to ensure that the COM port
* (CDC Data interface) is ready for sending data to the USB Host before calling
* this function.
*
* \param port
* COM port number. Valid ports are 0 and 1.
*
* \param ch
* Character to be sent.
*
* \param context
* The pointer to the context structure \ref cy_stc_usb_dev_cdc_context_t
* allocated by the user. The structure is used during the CDC Class operation
* for internal configuration and data retention. The user must not modify
* anything in this structure.
*
* \return
* Status code of the function execution \ref cy_en_usb_dev_status_t.
*
*******************************************************************************/
__STATIC_INLINE cy_en_usb_dev_status_t Cy_USB_Dev_CDC_PutChar(uint32_t port, char_t ch,
                                              cy_stc_usb_dev_cdc_context_t *context)
{
    /* Put data into the aligned buffer to work with 8-bit and 16-bit access type */
    uint16_t chBuffer = (uint16_t) ch;

    return Cy_USB_Dev_CDC_PutData(port, (uint8_t*) &chBuffer, 1U, context);
}


/*******************************************************************************
* Function Name: Cy_USB_Dev_CDC_GetParity
****************************************************************************//**
*
* Returns the parity type for the COM port.
*
* \param port
* COM port number. Valid ports are 0 and 1.
*
* \param context
* The pointer to the context structure \ref cy_stc_usb_dev_cdc_context_t
* allocated by the user. The structure is used during the CDC Class operation
* for internal configuration and data retention. The user must not modify
* anything in this structure.
*
* \return
* Parity type \ref cy_en_usb_dev_cdc_parity_type_t.
*
*******************************************************************************/
__STATIC_INLINE cy_en_usb_dev_cdc_parity_type_t Cy_USB_Dev_CDC_GetParity(uint32_t port, cy_stc_usb_dev_cdc_context_t const *context)
{
    CY_ASSERT_L1(CY_USB_DEV_CDC_IS_COM_VALID(port));

