RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb_shared/usbdev/cy_usb_dev_cdc.h
    return (cy_en_usb_dev_cdc_parity_type_t) context->port[port].linesCoding[CY_USB_DEV_CDC_LINE_CODING_PARITY_BITS_POS];
}


/*******************************************************************************
* Function Name: Cy_USB_Dev_CDC_GetDataBits
****************************************************************************//**
*
* Returns the number of data bits for the COM port.
*
* \param port
* COM port number. Valid ports are 0 and 1.
*
* \param context
* The pointer to the context structure \ref cy_stc_usb_dev_cdc_context_t
* allocated by the user. The structure is used during the CDC Class operation
* for internal configuration and data keeping. The user must not modify
* anything in this structure.
*
* \return
* Number of data bits, which can be 5, 6, 7, 8, or 16.
*
*******************************************************************************/
__STATIC_INLINE uint32_t Cy_USB_Dev_CDC_GetDataBits(uint32_t port, cy_stc_usb_dev_cdc_context_t const *context)
{
    CY_ASSERT_L1(CY_USB_DEV_CDC_IS_COM_VALID(port));

    return (uint32_t) context->port[port].linesCoding[CY_USB_DEV_CDC_LINE_CODING_DATA_BITS_POS];
}


/*******************************************************************************
* Function Name: Cy_USB_Dev_CDC_GetLineControl
****************************************************************************//**
*
* Returns the line control bitmap for the COM port.
*
* \param port
* COM port number. Valid ports are 0 and 1.
*
* \param context
* The pointer to the context structure \ref cy_stc_usb_dev_cdc_context_t
* allocated by the user. The structure is used during the CDC Class operation
* for internal configuration and data retention. The user must not modify
* anything in this structure.
*
* \return
* Line control bitmap \ref CY_USB_DEV_CDC_LINE_CONTROL_DTR and
* \ref CY_USB_DEV_CDC_LINE_CONTROL_RTS.
*
*******************************************************************************/
__STATIC_INLINE uint32_t Cy_USB_Dev_CDC_GetLineControl(uint32_t port, cy_stc_usb_dev_cdc_context_t const *context)
{
    CY_ASSERT_L1(CY_USB_DEV_CDC_IS_COM_VALID(port));

    return (uint32_t) context->port[port].linesControlBitmap;
}

/** \} group_usb_dev_cdc_functions */

#if defined(__cplusplus)
}
#endif

#endif /* (defined(CY_IP_MXUSBFS) || defined(CY_IP_M0S8USBDSS)) */

#endif /* (CY_USB_DEV_CDC_H) */


/* [] END OF FILE */
